---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeDocumentCorruption
source: html/ed2843b8-106f-6ef4-0b53-e89a7998e56b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeDocumentCorruption Property

Cannot create a DirectShape or DirectShapeType.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateDirectShapeOrTypeDocumentCorruption { get; }
```